/********************************************************************************
* @File name: bug1.c
* @Author: suvvm
* @Version: 0.0.1
* @Date: 2020-02-09
* @Description: c语言编写的应用程序用于测试内存访问越界bug
********************************************************************************/

#include "apilib.h"

/*******************************************************
*
* Function name: Main
* Description: bug1应用程序主函数
*
**********************************************************/
void Main() {
	char a[100];
	a[10] = 'A';
	apiPutchar(a[10]);
	a[102] = 'B';	// 越界
	apiPutchar(a[102]);
	a[123] = 'C';	// 越界
	apiPutchar(a[123]);
	apiEnd();
}
