/********************************************************************************
* @File name: bug1.c
* @Author: suvvm
* @Version: 0.0.1
* @Date: 2020-02-09
* @Description: c语言编写的应用程序用于测试内存访问越界bug
********************************************************************************/

/*******************************************************
*
* Function name: apiPutchar
* Description: 进行系统调用 调用dickApi显示字符的函数 具体定义在 helloCFunc.nas
* Parameter:
*	@c	要显示的字符ascii码	int
*
**********************************************************/
void apiPutchar(int c);

/*******************************************************
*
* Function name: apiEnd
* Description: 进行系统调用 调用dickApi结束应用程序 具体定义在 helloCFunc.nas
*
**********************************************************/
void apiEnd();

/*******************************************************
*
* Function name: Main
* Description: bug1应用程序主函数
*
**********************************************************/
void Main() {
	char a[100];
	a[10] = 'A';
	apiPutchar(a[10]);
	a[102] = 'B';	// 越界
	apiPutchar(a[102]);
	a[123] = 'C';	// 越界
	apiPutchar(a[123]);
	apiEnd();
}
