/********************************************************************************
* @File name: crack1.c
* @Author: suvvm
* @Version: 0.0.1
* @Date: 2020-02-08
* @Description: c语言编写的应用程序用于尝试破坏操作系统
********************************************************************************/

/*******************************************************
*
* Function name: apiEnd
* Description: 进行系统调用 调用dickApi结束应用程序 具体定义在 helloCFunc.nas
*
**********************************************************/
void apiEnd();

/*******************************************************
*
* Function name: Main
* Description: crack1应用程序主函数
*
**********************************************************/
void Main() {
	*((char *) 0x00102600) = 0;	// 向0x102600地址写入0
	apiEnd();
}
