/********************************************************************************
* @File name: helloCstr0.c
* @Author: suvvm
* @Version: 0.0.1
* @Date: 2020-02-09
* @Description: c语言编写的应用程序用调用dickApi打印字符串
********************************************************************************/

#include "apilib.h"

/*******************************************************
*
* Function name: Main
* Description: bug1应用程序主函数
*
**********************************************************/
void Main() {
	apiPutstr0("helloC string\n");
	apiEnd();
}
